[
  {
    "path": "posts/2021-07-15-nceas-orientation/",
    "title": "Orientation Logistics",
    "description": "How to Get to NCEAS",
    "author": [
      {
        "name": "Kimberly Yom",
        "url": {}
      }
    ],
    "date": "2021-07-15",
    "categories": [],
    "contents": "\nIn the last blog post, we mentioned that we had been busy building all kinds of things, e.g. courses, websites, even actual buildings! It’s finally time to use these newly-built objects. Only 13 days left until MEDS Orientation begins and we couldn’t be more excited to meet all of you!\nOrientation\nThe MEDS orientation will be a hybrid (in-person and remote) two-day event with Day 1 at Bren Hall and Day 2 at NCEAS (see instructions). During orientation, students will get up to speed on the necessary hardware and software, learn more about the program’s requirements and courses, and - of course - get to know one another! Students can view the schedule here using their NetID and password. Be sure to check your inboxes as we’ll be sending additional information you need to know!\nGetting to NCEAS\nAs you may already know, NCEAS recently moved from State Street to 1021 Anacapa St. In addition to hosting leading-edge research, this brand new building has a classroom and work stations for the MEDS students. Entering the building is a little tricky as the entrance to the MEDS space is off of the parking lot, not Anacapa - see photo below.\n\n\n\nParking\nThere is a city lot attached to the building. It is free for the first 75 minutes and $1.50 per hour after that. There is free street parking a few blocks away, just make sure to look for street sweeping restrictions.\nThere is limited bike parking available nearby on the sidewalk.\nBus\nIf you live in on-campus housing, or in Isla Vista, the Santa Barbara MTD 24X line is the most efficient bus route between NCEAS and the University. Hop on at the closest stop to your home, and get off at the transit center on Carillo and Chapala, which is just 2 blocks from NCEAS. Be sure to check the schedule so you arrive before Orientation and classes begin\nIf you have any questions, we can be reached at academics@bren.ucsb.edu.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-09-22T20:01:36-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-04-countdown-to-meds/",
    "title": "Countdown to MEDS: 105 days out",
    "description": "What we're up to with 4 months to go",
    "author": [
      {
        "name": "Allison Horst",
        "url": {
          "https://www.allisonhorst.com/": {}
        }
      },
      {
        "name": "Jamie Montgomery",
        "url": {
          "https://www.jamiecmontgomery.com/": {}
        }
      }
    ],
    "date": "2021-04-15",
    "categories": [],
    "contents": "\n\n\n\n\n\nThumbnail photo: Toy truck in a sandbox, by Markus Spiske on Unsplash\n\n\nWith less than four months until orientation for our first ever cohort of Master of Environmental Data Science students, we’re full speed ahead with MEDS! Covid-19 has changed how we work together (so much Zoom), but hasn’t lessened how much love and energy we’re putting into the program. Here’s a little bit about what we’ve been up to.\nBuilding this website\nWelcome to our MEDS website! We are building this website primarily as a place for our MEDS students to use as a resource for what’s happening in the program. It will contain links to course websites, information about daily schedules, career workshop schedules, capstone project timelines, and more!\nWe have big dreams for what this site will include - student blog posts! Interactive data visualizations! Capstone project highlights! Stay tuned as we build out the site with all things MEDS.\nExpanding the MEDS team\nSince October we’ve been doing a LOT of building - building courses, building cohesion across courses, building websites, and even building new classrooms. So yeah…a lot happening around here. Thankfully, we’ve also been building our MEDS team, and have recently welcomed exciting new team members dedicated specifically to the MEDS program.\nJamie Montgomery - MEDS Program Coordinator\n\n In January we were thrilled to welcome our amazing MEDS Program Coordinator Jamie Montgomery, alum of the Bren School Master of Environmental Science and Management program (Class of 2013), who for the past 8 years has been working as a Marine Data Scientist with the National Center for Ecological Analysis and Synthesis (NCEAS). Whether leading the Ocean Health Index’s US Northeast analysis, organizing (and teaching in) our world-famous Eco-Data-Science learning group, working to support diverse R-users through R-Ladies Santa Barbara, or doing special projects like analyzing tweets to evaluate where locals versus tourists tend to visit in SB, Jamie is a leader in Santa Barbara and R data science communities. We are so lucky to have her leading our trailblazing MEDS program!\n\nKimberly Yom - MEDS Admissions & Student Affairs Coordinator\n\n We also recently welcomed Kimberly Yom, our MEDS Admissions and Student Affairs Coordinator. Well, technically we welcomed her back to the Bren School - Kimberly previously worked at Bren as the MESM Academic Programs Assistant where she learned about Bren’s collaborative, mission-driven focus! After working in contract administration for the UCSB Design & Construction department, she is back at Bren as the MEDS Admissions and Student Affairs Coordinator. We are really grateful to have a person with so much knowledge about the inner workings of both the Bren School and UCSB in this role in MEDS!\nAs the Admissions and Student Affairs Coordinator, Kimberly recruits admitted students, helps organize the admissions process, evaluates applications, and hosts meetings with prospective and admitted students to answer questions about the MEDS program and provide campus resources. Kimberly is “thrilled about the advent of the MEDS program as it supplies students with the data science skills needed to develop informed solutions to the world’s complex environmental issues.” For any questions regarding admissions or MEDS program logistics, she can be reached at kyom@bren.ucsb.edu.\n\nMiya Scheble - MEDS Career Development Program Manager\n\nMiya Scheble joined the renowned Bren Career Team in November as the MEDS Career Development Program Manager. Prior to joining the Career Development team, Miya worked as a project coordinator and marketing assistant at a marketing, branding, and design company. She brings project management, customer relations, and marketing experience to Bren.\nAs the MEDS Career Development Program Manager, Miya oversees the day-to-day operations of the MEDS Career Development Program and helps students develop lifelong career skills that will help them secure desirable jobs and advance successfully throughout their entire career. With a background in environmental science and a strong interest in data science herself, Miya agrees with the NCEAS statement that “the next generation of environmental scientists are data scientists.” Miya is “very excited to welcome the first cohort of MEDS students and support them throughout their career journeys.” For more information about career development and advising services at Bren, she can be reached at: miya@bren.ucsb.edu.\n\nNCEAS on the move\nThe National Center for Ecological Analysis & Synthesis (NCEAS), which will be hosting the program part time, is moving! NCEAS has been located on State Street in downtown Santa Barbara for over 25 years. This year NCEAS is moving just a couple blocks away to 1021 Anacapa Street. Before we move, and while we are all still working from home, the building is undergoing some renovations. The first floor of the building will host the MEDS program and will have a brand new classroom that holds 90 students. In addition there will be a student lounge, private meeting room, kitchen, and dedicated work stations. We are so excited about this brand new space for our students, keep an eye out for pictures of the new space in July!\n\n\n\n",
    "preview": "posts/2021-04-04-countdown-to-meds/images/toy_truck.jpg",
    "last_modified": "2021-09-22T20:01:36-07:00",
    "input_file": {}
  }
]
