[
  {
    "path": "posts/2022-08-05-building-a-personal-website-using-quarto/",
    "title": "Building a personal website using Quarto",
    "description": "Only 5 days of programming experience? No problem! Quarto makes building and customizing websites fun and easy for new R (and other programming language) learners.",
    "author": [
      {
        "name": "Samantha Csik",
        "url": "https://samanthacsik.github.io/"
      }
    ],
    "date": "2022-08-08",
    "categories": [],
    "contents": "\nHi! My name is Sam\nCsik, and I’m the Data Training Coordinator at the National Center for Ecological\nAnalysis and Synthesis (NCEAS). I have the awesome job of developing\nand teaching data science workshops to supplement MEDS curricula – which\nmeans I get to spend lots of my time learning new tools and skills and\nsharing them with our students (IMHO, it’s pretty much the data science\ndream job\nStar).\nWe welcomed our second cohort of 31 MEDS students to NCEAS just one\nweek ago. Their first few days were spent reviewing a whole lot of math,\nlearning to navigate the RStudio IDE, being introduced to git/GitHub for\nversion control, writing functions, exploring and visualizing data, and\ncreating their first reproducible reports using RMarkdown. So a pretty\njam-packed week to start off our year!\nAs we neared the end of the first week, Dr. Allison Horst introduced\nthe class to Quarto, a scientific\npublishing tool that feels and looks a whole lot like RMarkdown –\nsomething that allows users to combine prose, code, and outputs into a\nsingle rendered (and importantly, reproducible) document. These can be\nstandalone documents, or users can combine multiple documents to create\nbooks, websites, slides and more.\n\n\n\nFigure 1: Art by Allison\nHorst: One penguin standing on another penguin’s shoulders in a\nsnowscape, looking through a telescope at a Quarto logo ‘moon’ in the\nnight sky.\n\n\n\nWe closed out week 1 learning how to use Quarto to build personal\nwebsites. While a large part of the MEDS program is focused on learning\ndata science tools and workflows, an equally important part is\nprofessional development. Personal websites are just one way to grow\nyour professional online presence – they can be a creative, informative,\nand fun outlet for data scientists to showcase their skills and\ninterests in one place, as well as a platform to help connect with\ncolleagues, community members, and potential employers.\nIf you’re interested in building your own personal website, check out\nour tutorial,\nexplore MEDS student websites here for\ninspiration, and stay tuned for more workshops on website\ncustomization!\n\n\n\n\n\n\n\n",
    "preview": "posts/2022-08-05-building-a-personal-website-using-quarto/quarto_share.png",
    "last_modified": "2022-08-09T11:51:09-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-01-06-capstone-proposal/",
    "title": "Capstone Reflections Part 1: Writing a Proposal",
    "description": {},
    "author": [
      {
        "name": "Halina Do-Linh and Clarissa Boyajian",
        "url": {}
      }
    ],
    "date": "2022-01-07",
    "categories": [],
    "contents": "\nHello! We are Halina and Clarissa, students at the University of California, Santa Barbara in the Bren School’s Masters of Environmental Data Science (MEDS) inaugural 2022 cohort.\nAbout us\nHalina has a BA in Environmental Studies & Biology from UC Santa Cruz and has experience in field research, outdoor education, environmental advocacy, and waste. While working in Los Angeles, she recognized data inaccuracies in representation and in metrics. Halina is excited to apply her data science training to address these gaps and to find equitable solutions for environmental issues affecting urban watersheds.\nClarissa holds a BA in Urban and Environmental Policy from Occidental College in Los Angeles, CA. She has experience with volunteer management and education, grant writing, and nonprofit management. In her 5+ years in the Los Angeles urban forestry sphere, she experienced a lack of data collection and analysis to guide program and policy decisions. She is excited to bring her data science training to collaborative work that creates equitable connections between people and the developed and wild environments.\nMEDS Capstone Project 101\nThe MEDS capstone project is a collaborative team experience where students use data to design, develop, and share a deliverable to help a client address an environmental issue. For the 2021-2022 academic year, all clients for capstone projects are UCSB affiliated, but in future years anyone will be able to propose a project. Projects that are chosen by the Capstone Committee get a team of 3-4 students from January to June 2022 (roughly 1 full-time staff for 6-months). All projects need to be product-oriented, have access to necessary data, be fully funded, have an environmental justice aspect, and have a clearly defined scope. Check out more in the timeline below!\n\nOur proposal and capstone\nWe were co-authors on the proposal, Ensuring equitable access to outdoor recreation: Evaluating spatiotemporal patterns and trends in campground use on federal public lands. This proposal was chosen as one of the final capstone projects for 2022. It will combine data from the Recreation Information Database (RIDB) and U.S. Census Data to create a tool that visually represents our analysis of access to federal lands. There is a growing need to understand and mitigate inequities in access to outdoor recreation, especially since outdoor recreation provides critical health and well-being benefits to communities. This proposal aligned closely with our interests, as we both have experience working directly with communities and the environment. Our primary deliverable is to create an interactive platform using the R Package, Shiny. The app will summarize and visualize park-specific patterns and trends in visitation volume, demand, and visitors’ location of origin.\nMajor shout out to Kaitlyn Gaynor and Will Rice for all their support and guidance on our proposal!\nOther capstones for the 2022 cohort\nAssessing Potential Environmental Justice Implications of Environmental Pressures from the Global Food System\nSnow Today: Delivering impactful information on snow cover and albedo to diverse global users through web based big data visualizations\nA web‐based application for visualizing spatial and temporal patterns of anthropogenic stressors on coral reefs in the lagoons of Moorea, French Polynesia\nRenewable Energy Siting Predictors Observed from National Data for Wind and Solar (RESPOND Wind and Solar)\nUnderstanding Climate Change’s Impact on the Forest Ecosystem: Developing a Reproducible Machine Learning Approach to Ecohydrologic Model Output\nAn open-source pipeline for remote sensing of crop yields under environmental change in Sub-Saharan Africa\nTips, thoughts, and recommendations\nNow that our proposal has been submitted (and selected!), we’ve taken some time to reflect on the proposal process. There’s a lot we’ve learned and we’ve compiled our most essential thoughts below.\nWhy you should write a proposal (even if you think you shouldn’t or can’t)\nWe won’t deny that writing a proposal can be a daunting task – it takes time and work – but we think it’s a worthwhile process. Even if the proposal deadline is two weeks away while you’re reading this, we encourage you to write a proposal! See if these reasons can convince you:\nYou will hear this plenty at Bren (if you haven’t already), but networking is a crucial part of your grad school experience. This includes networking with your cohort! Your cohort will be some of your strongest connections after you graduate, and working on a capstone proposal is a great opportunity to build those connections early. Beyond your cohort, working on a proposal with a client gives you many excellent opportunities to network with potential employers (or someone who can connect you to potential employers).\nThe MEDS program is a professional-degree program and is all about preparing you for a career to solve environmental problems using data science. The capstone proposal is one of the first opportunities to use what you’re learning. It’s a moment to practice several professional skills like project management, communication, research, proposal writing and data exploration. This means this is a real-life experience that you can put on your resume. We found this to be crucial for us since our backgrounds include less technical data experiences and we want to be able to graduate with both a degree and relevant experience.\nOur primary motivation to write a capstone proposal was because we care about the topic. We deeply care about environmental justice, and while we aren’t 100% sure what this looks like for our data science futures, we know we want careers that involve people and how they interact with the environment. So when we saw a proposal idea focused on studying spatiotemporal patterns of visitors in National Parks we both instantly wanted to know more. Writing a proposal gave us the opportunity to dive into a topic we were interested in. This made writing the proposal less of a daunting task since we were internally motivated. It also meant that we were more willing to challenge ourselves because we personally care about the outcome of the proposal.\nMost Helpful Resources\nEach other! After the first few weeks of summer, you and your cohort will have already spent at least 40 hrs a week with each other. Meaning - there’s a good chance you’ll have at least a basic understanding of everyone’s interests (also you may not have an interest yet, or maybe your interests are only vague ideas - that’s okay!). Anyway, what we are trying to say is find who in your cohort has similar interests to you. Because writing a proposal together makes the whole task less daunting. This allows you to split up the work, lean on each other for support, and discuss when you feel uncertain.\nWe approached our client the second week of the summer and started brainstorming ideas soon after. By starting early, this gave us time to really sit with the information, the data, and the overall question we wanted to answer. When it comes to writing a proposal, time to sit and reflect about your proposal idea is part of the process.\nNot sure where to start your research? Have too many topics you’re interested in? Talk to a librarian! Each department at UCSB has their own dedicated librarian. Check out the Subject Guides webpage on the library’s website for resources and contact information to subject experts. You might also want to check out the Zotero Workshop so you can start organizing your background research right away.\nSomething else you’ve probably heard is don’t reinvent the wheel. Many functions and solutions you need already exist thanks to the many amazing and talented individuals within the data science field. The same goes for project proposals. If you’re getting writer’s block, look at the Master’s Project Directory on the Bren website to see proposals from previous years for inspiration (Bren students have been doing capstone projects since 1999).\nIf you haven’t written in awhile…talk to professors or students in the Communications Focus! They know how important writing skills are and want you to succeed. Some helpful readings to check out are:\nOn the Art of Writing Proposals by Adam Pzreworski and Frank Salomon. This is a pretty quick read - only 9 pages!\nResearch Design: Qualitative, Quantitative, and Mixed Methods Approaches by John W. Creswell. Skip to Chapter Two: Review of the Literature.\n\nThe “hardest” parts of the process\nWriting a proposal is doable and we’re all capable of writing one. For us, describing the work before we’ve learned how to do it was the most overwhelming part of the process. But you’re not alone! That’s where the clients for our project came into play. They were able to put into technical terms our ideas and excitement for the project. Don’t be afraid to be upfront with what you don’t know yet.\nHow to consider an Environmental Justice lens in your proposal (and beyond)\nEnvironmental Justice (EJ) has multiple definitions that changes with context. One framework we’d like to share with you is intersectional environmentalism, coined by Leah Thomas. Intersectional environmentalism focuses on the interconnections between injustices that harm people (especially frontline communities or those who have been historically discriminated against) and the environment. This is a crucial lens to maintain while you are writing your proposal because the solutions we write about are not solutions unless it works for everyone involved. We have found this lens to be challenging at times because it forces us to think differently and tests assumptions we’ve grown up with, but ultimately it makes us better data scientists.\nHere are some EJ themes and questions to think about while writing your proposal. These questions use Justice Analysis to identify environmental injustices and come from Bren’s Equity and the Environment course (highly recommend taking).\nPower\nWho has the power in the situation? Who has privilege? How does power and privilege play into communication, representation, access to resources, or decision-making?\nDistribution of Harm\nWho is receiving the brunt of the suffering or harm in the situation?\nAnthropocentrism / Species-ism\nWhat aspects of the environment are being systematically overlooked and why? How is excessive self-centeredness playing into this - on the part of the humans? What can we do to overcome it?\nRacism & Xenophobia\nHow is this factoring into the situation? Does someone have less power or privilege because of their race or ethnicity?\nWays of Knowing\nWhose ‘way of knowing’ are privileged? Is there a type of evidence or data that is privileged over others? Is the worldview of the dominant group causing harm?\nExclusionary Solutions\nDoes what is offered make sense for all potential parties involved? Is the solution reasonable and accessible?\nBurden of Evidence\nWho is responsible for showing there is environmental harm? Is this appropriate? What would an alternative be?\nIt’s only week 1 of Winter quarter and we’re just getting started! Come back for more Capstone updates over the next 6 months.\n\n\n\n",
    "preview": "posts/2022-01-06-capstone-proposal/j-kelly-brito-PeUJyoylfe4-unsplash.jpeg",
    "last_modified": "2022-07-28T09:55:57-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-24-summery-summary/",
    "title": "A Summer-y Summary of MEDS Quarter 1",
    "description": {},
    "author": [
      {
        "name": "Juliet Cohen and Scout Leonard",
        "url": {}
      }
    ],
    "date": "2021-09-24",
    "categories": [],
    "contents": "\nHi there! This post is coming to you from Juliet Cohen and Scout Leonard! We are both students at UCSB’s Bren School of Environmental Science & Management in the inaugural cohort of the Masters of Environmental Data Science (MEDS) Program.\nAbout us\nScout is interested in growing as an environmental data scientist after having worked with large datasets through food system and food security work in Oakland, California. Already, she is so pleased with the emphasis her MEDS courses have placed on responsible data science, as she hopes to use her MEDS toolkit to influence food security and resource use policy that builds sustainable, equitable food systems. You can learn more about her previous and ongoing work at her website: scoutcleonard.github.io.\nJuliet is interested in applying environmental data science to wildlife biology and the interaction between humans and endangered species’ natural habitats. Juliet was inspired by her experience serving as a field technician in California and Hawaii. Throughout the MEDS summer curriculum, Juliet strengthened her collaborative programming skills and looks forward to learning about spatial analysis and modeling large, dynamic data sets. She hopes to contribute to open-source projects in the future.\nMEDS Summer Session\nFor the first 6 weeks of our degree, we embarked on a whirlwind introduction to data science. From 9 AM to 5 PM we sat in the newly constructed MEDS classroom at the National Center for Ecological Analysis and Synthesis (NCEAS) in downtown Santa Barbara, learning the basics to jumpstart our data science degrees. These week-long classes consisted not only of lectures, but oalso coding labs, collaborative team science projects, individual and group presentations. We also had “flex sessions” for non-course content, like panels from various data scientists at NCEAS and representatives from local groups of R users, such as Santa Barbara R Ladies and EcoDataScience. Our summer term laid the foundation not only for the code we’ll write this year, but also for how we create workflows and collaborate as budding environmental data scientists. These courses included:\nEDS 212: Essential Math in Environmental Data Science\nEDS 221: Scientific Programming Essentials\nEDS 214: Analytical Workflows and Scientific Reproducibility\nEDS 215: Introduction to Data Storage and Management\nEDS 216: Meta-Analysis and Systematic Reviews\nAfter this intense MEDS summer we took some time to relax before fall quarter, but we also took this blog-post-writing opportunity to showcase some of what our class has learned so far.\nAs we reflected on the first quarter of our degree, we decided it may be more interesting to show, rather than tell, some of the skills we’ve learned. We also thought it might be fun to share reflections from our whole cohort to truly represent the student experience of this fast-paced, learning-filled summer.\nWhat did MEDS students think about summer courses?\nSurvey Development\nWe developed a Google Form survey for our classmates to gather data about their perspectives on these first six weeks. We had two main questions:\nwhat did the cohort think of our classes?\nwhat kinds of fun things has the group been up to in our delightful home of Santa Barbara?\nOur questions were developed with data tidying and visualization in mind and when we got some unexpected answers, we developed perspective about how our survey could have been better to help us with a bit less wrangling. MEDS students, however, do not shy away from problematic data, so we persisted with the problems that arose :)\nAnalysis\nThe following is a step-by-step description of how we wrangled and visualized the most interesting survey responses including neat graphics describing our MEDS summer, from tidying data to surfing after class. We hope you find it insightful, but also fun :)\nOur Data\n\n\n#load libraries\nlibrary(tidyverse)\nlibrary(dplyr)\nlibrary(janitor)\nlibrary(here)\nlibrary(wordcloud)\nlibrary(RColorBrewer)\nlibrary(patchwork)\nlibrary(ggwordcloud)\nlibrary(paletteer)\n\n\n\nFirst, we read the data from our Google form survey, which we were able to download as a .csv file, into the R project we made for this blog project.\n\n\ndata <- read_csv(\"data/MEDS Summer Reflection Survey (Responses) - Responses Clean.csv\")\n\n\n\nData Tidying\nNext, we renamed the columns. Google forms does this frustrating, but understandable thing where the names of the columns of data are the questions we asked participants. This makes for super long names that are not fun to write code with. We instead named the columns of interest with the corresponding order of our coursework, i.e. column 1 is our first course, EDS 212.\n\n\n#colnames(data) renames the columns\n\ndata_clean <- data %>% \n  rename(\"1\" =  \"Write 3 words to describe or represent week 1 (EDS212 w/ Allison) here:\") %>% \n  rename(\"2_3\" =  \"Write 3 words to describe or represent weeks 2 & 3 (EDS221 w/ Allison) here:\") %>% \n  rename(\"4\" =  \"Write 3 words to describe or represent week 4 (EDS214 w/ Julien) here:\") %>% \n  rename(\"5\" =  \"Write 3 words to describe or represent week 5 (EDS215 w/ Frew) here:\") %>% \n  rename(\"6\" =  \"Write 3 words to describe or represent week 1 (EDS216 w/ Scott) here:\")\n\n\n\nData Wrangling\nThe Google form format included five questions (one for each summer course) where students wrote in three words to describe how they felt about the course. In the .csv of the survey data, the three words submitted by a participant were grouped together in one cell per course.\nTo visualize how often certain descriptors for each summer course appear, we first needed to separate the three terms submitted for each course into separate observations. We executed this using the separate_rows() function. This expanded the terms into three separate observations per student in each class column.\n\n\n# separate the columns into rows by parsing the 3 words in each observation into 3 different observations\n# select certain cols because our first data viz is only using certain cols \ndata_clean_1 <- data_clean %>% \n  separate_rows(\"1\") %>% \n  select(\"Email Address\",\"1\")\n\ndata_clean_2_3 <- data_clean %>% \n  separate_rows(\"2_3\")%>% \n  select(\"Email Address\",\"2_3\")\n\ndata_clean_4 <- data_clean %>% \n  separate_rows(\"4\") %>% \n  select(\"Email Address\",\"4\")\n\ndata_clean_5 <- data_clean %>% \n  separate_rows(\"5\") %>% \n  select(\"Email Address\",\"5\")\n\ndata_clean_6 <- data_clean %>% \n  separate_rows(\"6\") %>% \n  select(\"Email Address\",\"6\")\n\n\n\nThen, to observe the frequency of words used to describe each course, we used the table function. This creates a table that has two columns: one for each distint descriptive word students used and the frequency with which the words occur for the class. Then, we converted that table to a data frame.\n\n\n# use the table() function to take counts of each \"factor\" (words) and use the data.frame() function to convert these tables to data frames\n\ncourse_1 <- data.frame(table(data_clean_1$\"1\"))\n\ncourse_1_df <- as.data.frame.matrix(course_1)\n\ncourse_2_3 <- data.frame(table(data_clean_2_3$\"2_3\"))\n\ncourse_2_3_df <- as.data.frame.matrix(course_2_3)\n\ncourse_4 <- data.frame(table(data_clean_4$\"4\"))\n\ncourse_4_df <- as.data.frame.matrix(course_4)\n\ncourse_5 <- data.frame(table(data_clean_5$\"5\"))\n\ncourse_5_df <- as.data.frame.matrix(course_5) %>% \n  filter(!Var1 == \"tangent\") %>% \n  filter(!Var1 == \"tangents\") %>% \n  filter(!Var1 == \"dry\")\n\ncourse_6 <- data.frame(table(data_clean_6$\"6\"))\n\ncourse_6_df <- as.data.frame.matrix(course_6)\n\n\n\nData Visualizing\nAfter this, we wanted to visualize the frequency of words for each class. We used ggplot to create word clouds which represented the frequency of class descriptors. The word clouds display the descriptive words submitted by our classmates in sizes proportional to the frequency the words were used. The ggplot plot we used is called ggwordcloud. We updated the colors by adding an aesthetic feature where each class descriptor is represented by a different color. We also updated the word size so that the cloud was easier to read.\nSince we used ggplot quite a bit in EDS 221, we opted for this method for generating word clouds over another package called wordcloud, which is specifically for word clouds. We found that we wanted to showcase our visualization skills by stacking visualizations and adding titles and colors, and it was easier to do this in a ggplot version of word clouds, since we had so much practice with other plots in ggplot.\nThe code chunk below is where we tried the wordcloud package. It made the correct visualizations, but we found it more difficult to make them as nice as some of the ggplots we made in class. It was a relief to learn that there is a word cloud feature in ggplot!\nAnd finally, the ggplot word clouds!\n\n\n# for each cloud, specify the background color within the theme to match the background color of the blog This same code was repeated for all word clouds.\n\ncloud_1 <- ggplot(course_1_df, aes(label = Var1, size = Freq, color = Var1)) +\n  geom_text_wordcloud() +\n  scale_size_area(max_size = 25) +\n  theme(plot.title = element_text(size = 25),\n        panel.background = element_rect(fill = \"white\")) +\n  labs(title = \"Week 1 EDS 212: Essential Math in Environmental Data Science\")\n\n\n\n\n\n\n\n\n# use patchwork to stack the graphs\n\ncloud_1 / cloud_2_3 / cloud_4 / cloud_5 / cloud_6\n\n\n\n\nWhat do MEDS students do outside of class?\nOur full-day classes kept us busy during the week, but since they were designed without additional assignments outside of class we were able to take advantage of our evenings and weekends. The most popular activities were surfing, going to the beach, and biking.\n\n\n# download cvs for SB activities\ndata_activities <- read_csv(\"data/sb_activities_data.csv\")\n\n# make data.frame for SB activities histogram\n\nactivities_clean <- data.frame(table(data_activities$\"sb_activities\"))\n\nSB_activities <- ggplot(activities_clean, aes(y = reorder(Var1, +Freq), x = Freq)) +\n  geom_histogram(stat = 'identity', aes(fill = Var1, color = \"blue\")) +\n  scale_fill_paletteer_d(\"dutchmasters::milkmaid\") +\n  theme(legend.position = \"none\",\n        panel.grid = element_blank(),\n        panel.background = element_rect(fill = \"white\")) +\n  labs(title = \"MEDS Favorite Santa Barbara Activities\",\n       y = \"Activity\",\n       x = \"Total Votes\")\n\nSB_activities\n\n\n\n\nWhat are the MEDS students excited for in Fall quarter?\n\n“Expanding my coding fundamentals, tidy Tuesday’s, building a portfolio and updating my website, and working collaboratively on the capstone project.”\n\n\n“I’m excited to build on the foundation we created this summer!”\n\n\n“Excited to work with some spatial data in Frew’s next class!”\n\n\n“I’m looking forward to learning more skills in data science and be able to apply them to assignments and projects in our classes. I’m also looking forward to learning more about potential future careers in environmental data science.”\n\nMeet the MEDS cohort!\nClass photo on our first day of Orientation at Bren Hall\nThe MEDS 2022 cohort gathered at NCEAS after class during summer session.\nMembers of the MEDS cohort in downtown Santa Barbara celebrating completing the first half of summer session classes with faculty and their pets.\n\n\n\n",
    "preview": "posts/2021-09-24-summery-summary/preview_image.jpg",
    "last_modified": "2022-07-28T09:55:57-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-07-15-nceas-orientation/",
    "title": "Orientation Logistics",
    "description": "How to Get to NCEAS",
    "author": [
      {
        "name": "Kimberly Yom",
        "url": {}
      }
    ],
    "date": "2021-07-15",
    "categories": [],
    "contents": "\nIn the last blog post, we mentioned that we had been busy building all kinds of things, e.g. courses, websites, even actual buildings! It’s finally time to use these newly-built objects. Only 13 days left until MEDS Orientation begins and we couldn’t be more excited to meet all of you!\nOrientation\nThe MEDS orientation will be a hybrid (in-person and remote) two-day event with Day 1 at Bren Hall and Day 2 at NCEAS (see instructions). During orientation, students will get up to speed on the necessary hardware and software, learn more about the program’s requirements and courses, and - of course - get to know one another! Students can view the schedule here using their NetID and password. Be sure to check your inboxes as we’ll be sending additional information you need to know!\nGetting to NCEAS\nAs you may already know, NCEAS recently moved from State Street to 1021 Anacapa St. In addition to hosting leading-edge research, this brand new building has a classroom and work stations for the MEDS students. Entering the building is a little tricky as the entrance to the MEDS space is off of the parking lot, not Anacapa - see photo below.\n\n\n\nParking\nThere is a city lot attached to the building. It is free for the first 75 minutes and $1.50 per hour after that. There is free street parking a few blocks away, just make sure to look for street sweeping restrictions.\nThere is limited bike parking available nearby on the sidewalk.\nBus\nIf you live in on-campus housing, or in Isla Vista, the Santa Barbara MTD 24X line is the most efficient bus route between NCEAS and the University. Hop on at the closest stop to your home, and get off at the transit center on Carillo and Chapala, which is just 2 blocks from NCEAS. Be sure to check the schedule so you arrive before Orientation and classes begin\nIf you have any questions, we can be reached at academics@bren.ucsb.edu.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-07-28T09:55:57-07:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-04-countdown-to-meds/",
    "title": "Countdown to MEDS: 105 days out",
    "description": "What we're up to with 4 months to go",
    "author": [
      {
        "name": "Allison Horst",
        "url": {
          "https://www.allisonhorst.com/": {}
        }
      },
      {
        "name": "Jamie Montgomery",
        "url": {
          "https://www.jamiecmontgomery.com/": {}
        }
      }
    ],
    "date": "2021-04-15",
    "categories": [],
    "contents": "\n\n\n\n\n\nThumbnail photo: Toy truck in a sandbox, by Markus Spiske on Unsplash\n\n\nWith less than four months until orientation for our first ever cohort of Master of Environmental Data Science students, we’re full speed ahead with MEDS! Covid-19 has changed how we work together (so much Zoom), but hasn’t lessened how much love and energy we’re putting into the program. Here’s a little bit about what we’ve been up to.\nBuilding this website\nWelcome to our MEDS website! We are building this website primarily as a place for our MEDS students to use as a resource for what’s happening in the program. It will contain links to course websites, information about daily schedules, career workshop schedules, capstone project timelines, and more!\nWe have big dreams for what this site will include - student blog posts! Interactive data visualizations! Capstone project highlights! Stay tuned as we build out the site with all things MEDS.\nExpanding the MEDS team\nSince October we’ve been doing a LOT of building - building courses, building cohesion across courses, building websites, and even building new classrooms. So yeah…a lot happening around here. Thankfully, we’ve also been building our MEDS team, and have recently welcomed exciting new team members dedicated specifically to the MEDS program.\nJamie Montgomery - MEDS Program Coordinator\n\n In January we were thrilled to welcome our amazing MEDS Program Coordinator Jamie Montgomery, alum of the Bren School Master of Environmental Science and Management program (Class of 2013), who for the past 8 years has been working as a Marine Data Scientist with the National Center for Ecological Analysis and Synthesis (NCEAS). Whether leading the Ocean Health Index’s US Northeast analysis, organizing (and teaching in) our world-famous Eco-Data-Science learning group, working to support diverse R-users through R-Ladies Santa Barbara, or doing special projects like analyzing tweets to evaluate where locals versus tourists tend to visit in SB, Jamie is a leader in Santa Barbara and R data science communities. We are so lucky to have her leading our trailblazing MEDS program!\n\nKimberly Yom - MEDS Admissions & Student Affairs Coordinator\n\n We also recently welcomed Kimberly Yom, our MEDS Admissions and Student Affairs Coordinator. Well, technically we welcomed her back to the Bren School - Kimberly previously worked at Bren as the MESM Academic Programs Assistant where she learned about Bren’s collaborative, mission-driven focus! After working in contract administration for the UCSB Design & Construction department, she is back at Bren as the MEDS Admissions and Student Affairs Coordinator. We are really grateful to have a person with so much knowledge about the inner workings of both the Bren School and UCSB in this role in MEDS!\nAs the Admissions and Student Affairs Coordinator, Kimberly recruits admitted students, helps organize the admissions process, evaluates applications, and hosts meetings with prospective and admitted students to answer questions about the MEDS program and provide campus resources. Kimberly is “thrilled about the advent of the MEDS program as it supplies students with the data science skills needed to develop informed solutions to the world’s complex environmental issues.” For any questions regarding admissions or MEDS program logistics, she can be reached at kyom@bren.ucsb.edu.\n\nMiya Scheble - MEDS Career Development Program Manager\n\nMiya Scheble joined the renowned Bren Career Team in November as the MEDS Career Development Program Manager. Prior to joining the Career Development team, Miya worked as a project coordinator and marketing assistant at a marketing, branding, and design company. She brings project management, customer relations, and marketing experience to Bren.\nAs the MEDS Career Development Program Manager, Miya oversees the day-to-day operations of the MEDS Career Development Program and helps students develop lifelong career skills that will help them secure desirable jobs and advance successfully throughout their entire career. With a background in environmental science and a strong interest in data science herself, Miya agrees with the NCEAS statement that “the next generation of environmental scientists are data scientists.” Miya is “very excited to welcome the first cohort of MEDS students and support them throughout their career journeys.” For more information about career development and advising services at Bren, she can be reached at: miya@bren.ucsb.edu.\n\nNCEAS on the move\nThe National Center for Ecological Analysis & Synthesis (NCEAS), which will be hosting the program part time, is moving! NCEAS has been located on State Street in downtown Santa Barbara for over 25 years. This year NCEAS is moving just a couple blocks away to 1021 Anacapa Street. Before we move, and while we are all still working from home, the building is undergoing some renovations. The first floor of the building will host the MEDS program and will have a brand new classroom that holds 90 students. In addition there will be a student lounge, private meeting room, kitchen, and dedicated work stations. We are so excited about this brand new space for our students, keep an eye out for pictures of the new space in July!\n\n\n\n",
    "preview": "posts/2021-04-04-countdown-to-meds/images/toy_truck.jpg",
    "last_modified": "2022-07-28T09:55:57-07:00",
    "input_file": {}
  }
]
